Tekla Open API Reference for Tekla Structures 2025
StructuresInstallation.BinFolder Property
 Gets Path to Tekla Structures binary (bin) directory.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static string BinFolder { get; }
Public Shared ReadOnly Property BinFolder As String
	Get
Property Value
Type: String
See Also
Reference
StructuresInstallation Class
Tekla.Structures.Dialog Namespace